In [1]:
pip install scikit-learn matplotlib

Requirement already satisfied: scikit-learn in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (1.6.1)
Requirement already satisfied: matplotlib in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (3.6.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn) (3.6.0)
Requirement already satisfied: joblib>=1.2.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: numpy>=1.19.5 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn) (1.22.2)
Requirement already satisfied: scipy>=1.6.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from scikit-learn) (1.9.3)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (1.0.6)
Requirement already satisfied: packaging>=20.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (24.2)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (3.0.7)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (1.4.4)
Requirement already satisfied: cycler>=0.10 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (4.38.0)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (2.8.2)
Requirement already satisfied: pillow>=6.2.0 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from matplotlib) (9.3.0)
Requirement already satisfied: six>=1.5 in c:\users\shyam\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.3; however, version 25.0.1 is available.
You should consider upgrading via the 'C:\Users\shyam\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [2]:
import pandas as pd

In [3]:
from sklearn.datasets import fetch_california_housing

In [4]:
df = fetch_california_housing(as_frame=True).frame

In [5]:
df

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
0,8.3252,41.0,6.984127,1.023810,322.0,2.555556,37.88,-122.23,4.526
1,8.3014,21.0,6.238137,0.971880,2401.0,2.109842,37.86,-122.22,3.585
2,7.2574,52.0,8.288136,1.073446,496.0,2.802260,37.85,-122.24,3.521
3,5.6431,52.0,5.817352,1.073059,558.0,2.547945,37.85,-122.25,3.413
4,3.8462,52.0,6.281853,1.081081,565.0,2.181467,37.85,-122.25,3.422
...,...,...,...,...,...,...,...,...,...
20635,1.5603,25.0,5.045455,1.133333,845.0,2.560606,39.48,-121.09,0.781
20636,2.5568,18.0,6.114035,1.315789,356.0,3.122807,39.49,-121.21,0.771
20637,1.7000,17.0,5.205543,1.120092,1007.0,2.325635,39.43,-121.22,0.923
20638,1.8672,18.0,5.329513,1.171920,741.0,2.123209,39.43,-121.32,0.847
20639,2.3886,16.0,5.254717,1.162264,1387.0,2.616981,39.37,-121.24,0.894

In [6]:
df.head(5)    # first 5 rows

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
0,8.3252,41.0,6.984127,1.023810,322.0,2.555556,37.88,-122.23,4.526
1,8.3014,21.0,6.238137,0.971880,2401.0,2.109842,37.86,-122.22,3.585
2,7.2574,52.0,8.288136,1.073446,496.0,2.802260,37.85,-122.24,3.521
3,5.6431,52.0,5.817352,1.073059,558.0,2.547945,37.85,-122.25,3.413
4,3.8462,52.0,6.281853,1.081081,565.0,2.181467,37.85,-122.25,3.422

In [7]:
df.tail(5)     # last 5 rows

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
20635,1.5603,25.0,5.045455,1.133333,845.0,2.560606,39.48,-121.09,0.781
20636,2.5568,18.0,6.114035,1.315789,356.0,3.122807,39.49,-121.21,0.771
20637,1.7000,17.0,5.205543,1.120092,1007.0,2.325635,39.43,-121.22,0.923
20638,1.8672,18.0,5.329513,1.171920,741.0,2.123209,39.43,-121.32,0.847
20639,2.3886,16.0,5.254717,1.162264,1387.0,2.616981,39.37,-121.24,0.894

In [8]:
df.sample()    # picks random rows

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
16602,2.4567,43.0,5.006579,1.072368,1456.0,2.394737,35.62,-120.69,1.4

In [9]:
df.columns    #display all column names

Index(['MedInc', 'HouseAge', 'AveRooms', 'AveBedrms', 'Population', 'AveOccup',
       'Latitude', 'Longitude', 'MedHouseVal'],
      dtype='object')

In [10]:
pd.options.display.max_columns = 5

In [11]:
df

       MedInc  HouseAge  ...  Longitude  MedHouseVal
0      8.3252      41.0  ...    -122.23        4.526
1      8.3014      21.0  ...    -122.22        3.585
2      7.2574      52.0  ...    -122.24        3.521
3      5.6431      52.0  ...    -122.25        3.413
4      3.8462      52.0  ...    -122.25        3.422
...       ...       ...  ...        ...          ...
20635  1.5603      25.0  ...    -121.09        0.781
20636  2.5568      18.0  ...    -121.21        0.771
20637  1.7000      17.0  ...    -121.22        0.923
20638  1.8672      18.0  ...    -121.32        0.847
20639  2.3886      16.0  ...    -121.24        0.894

[20640 rows x 9 columns]

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MedInc       20640 non-null  float64
 1   HouseAge     20640 non-null  float64
 2   AveRooms     20640 non-null  float64
 3   AveBedrms    20640 non-null  float64
 4   Population   20640 non-null  float64
 5   AveOccup     20640 non-null  float64
 6   Latitude     20640 non-null  float64
 7   Longitude    20640 non-null  float64
 8   MedHouseVal  20640 non-null  float64
dtypes: float64(9)
memory usage: 1.4 MB

In [13]:
# to describe table count, mean, min, max....
df.describe()

             MedInc      HouseAge  ...     Longitude   MedHouseVal
count  20640.000000  20640.000000  ...  20640.000000  20640.000000
mean       3.870671     28.639486  ...   -119.569704      2.068558
std        1.899822     12.585558  ...      2.003532      1.153956
min        0.499900      1.000000  ...   -124.350000      0.149990
25%        2.563400     18.000000  ...   -121.800000      1.196000
50%        3.534800     29.000000  ...   -118.490000      1.797000
75%        4.743250     37.000000  ...   -118.010000      2.647250
max       15.000100     52.000000  ...   -114.310000      5.000010

[8 rows x 9 columns]

In [14]:
df['MedInc']

0        8.3252
1        8.3014
2        7.2574
3        5.6431
4        3.8462
          ...
20635    1.5603
20636    2.5568
20637    1.7000
20638    1.8672
20639    2.3886
Name: MedInc, Length: 20640, dtype: float64

In [15]:
df['MedInc'].mean()   #df['MedInc'].min() or max() or count() or sum()

3.8706710029069766

In [16]:
df = pd.DataFrame({
    'name': ['shyam', 'ram', 'ravi', 'raj'],
    'age' : [25, 25, 30, 32],
    'job' : ['develope', 'developer', 'clerk', 'designer']    
})

In [17]:
df

    name  age        job
0  shyam   25   develope
1    ram   25  developer
2   ravi   30      clerk
3    raj   32   designer

In [18]:
#df.loc[1]
df = df.set_index('name')

In [19]:
df

       age        job
name
shyam   25   develope
ram     25  developer
ravi    30      clerk
raj     32   designer

In [20]:
df.loc['ravi']

age       30
job    clerk
Name: ravi, dtype: object

In [21]:
df.loc['ravi','age']  # 'ravi' is the index row and 'age' is the first column

30

In [22]:
df.at['ravi','age']

30

In [23]:
df.iloc[1]

age           25
job    developer
Name: ram, dtype: object

In [24]:
df.iloc[1,0]    # here 'name' is index row and 'age' is first coulum '0' index

25

In [25]:
df.iat[1,0]

25

In [26]:
# change 'ravi' age = 60
df.at['ravi','age'] = 60

In [27]:
df

       age        job
name
shyam   25   develope
ram     25  developer
ravi    60      clerk
raj     32   designer

In [28]:
# change entire row 
df.loc['ravi'] = [45,'HR']

In [29]:
df

       age        job
name
shyam   25   develope
ram     25  developer
ravi    45         HR
raj     32   designer

In [30]:
# add new rows
df.loc['john'] = [25,'drawer']

In [31]:
df

       age        job
name
shyam   25   develope
ram     25  developer
ravi    45         HR
raj     32   designer
john    25     drawer

In [32]:
# we can use slicing with iloc
df.iloc[0:2]

       age        job
name
shyam   25   develope
ram     25  developer

In [33]:
# all rows and 1st column only
df.iloc[:,1]

name
shyam     develope
ram      developer
ravi            HR
raj       designer
john        drawer
Name: job, dtype: object

In [34]:
# multiply age column with 2
df.age * 2

name
shyam    50
ram      50
ravi     90
raj      64
john     50
Name: age, dtype: int64

In [35]:
# how to do some other logics
def myfunction(x):
    if x % 3 == 0:
        return x**2
    else:
        return x//2

In [36]:
df.age.apply(myfunction)

name
shyam      12
ram        12
ravi     2025
raj        16
john       12
Name: age, dtype: int64

In [37]:
# how to do some other logics
def myfunction2(x):
    if x.endswith('R'):
        return 'no job'
    else:
        return x

In [38]:
df.job.apply(myfunction2)

name
shyam     develope
ram      developer
ravi        no job
raj       designer
john        drawer
Name: job, dtype: object

In [39]:
# we can use lambda function for simple functions
df.age.apply(lambda x: x ** 2 if x % 10 == 0 else x // 2)

name
shyam    12
ram      12
ravi     22
raj      16
john     12
Name: age, dtype: int64

In [40]:
# creating summary column
df['summary'] = df.apply(lambda row : f"Age: {row['age']}, job: {row['job']}", axis=1)

In [41]:
df

       age        job                  summary
name
shyam   25   develope   Age: 25, job: develope
ram     25  developer  Age: 25, job: developer
ravi    45         HR         Age: 45, job: HR
raj     32   designer   Age: 32, job: designer
john    25     drawer     Age: 25, job: drawer

In [44]:
# to drop a column
# for multiple columns deletion df.drop(['summary','age'],axis=1)
df.drop('summary',axis=1)

       age        job
name
shyam   25   develope
ram     25  developer
ravi    45         HR
raj     32   designer
john    25     drawer

In [43]:
df

       age        job                  summary
name
shyam   25   develope   Age: 25, job: develope
ram     25  developer  Age: 25, job: developer
ravi    45         HR         Age: 45, job: HR
raj     32   designer   Age: 32, job: designer
john    25     drawer     Age: 25, job: drawer

In [45]:
df.at['raj','age'] = float('nan')

In [46]:
df

        age        job                  summary
name
shyam  25.0   develope   Age: 25, job: develope
ram    25.0  developer  Age: 25, job: developer
ravi   45.0         HR         Age: 45, job: HR
raj     NaN   designer   Age: 32, job: designer
john   25.0     drawer     Age: 25, job: drawer

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, shyam to john
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   age      4 non-null      float64
 1   job      5 non-null      object
 2   summary  5 non-null      object
dtypes: float64(1), object(2)
memory usage: 332.0+ bytes

In [49]:
# to drop 'nan' values
df.dropna()

        age        job                  summary
name
shyam  25.0   develope   Age: 25, job: develope
ram    25.0  developer  Age: 25, job: developer
ravi   45.0         HR         Age: 45, job: HR
john   25.0     drawer     Age: 25, job: drawer

In [50]:
# to fill 'nan' values if nan put '0'
df.fillna(0)

        age        job                  summary
name
shyam  25.0   develope   Age: 25, job: develope
ram    25.0  developer  Age: 25, job: developer
ravi   45.0         HR         Age: 45, job: HR
raj     0.0   designer   Age: 32, job: designer
john   25.0     drawer     Age: 25, job: drawer

In [51]:
# if nan value fill it with mean value
df.age.fillna(df.age.mean())

name
shyam    25.0
ram      25.0
ravi     45.0
raj      30.0
john     25.0
Name: age, dtype: float64

In [52]:
# this will keep non values to False
df.notna()

         age   job  summary
name
shyam   True  True     True
ram     True  True     True
ravi    True  True     True
raj    False  True     True
john    True  True     True

In [54]:
# it will display complete table except 'Flase' values 'age'
df[df.age.notna()]

        age        job                  summary
name
shyam  25.0   develope   Age: 25, job: develope
ram    25.0  developer  Age: 25, job: developer
ravi   45.0         HR         Age: 45, job: HR
john   25.0     drawer     Age: 25, job: drawer

In [55]:
# Iterate over each individual rows
df.iterrows()

In [61]:
for i, row in df.iterrows():
    print(i, row)
    break

shyam age                          25.0
job                      develope
summary    Age: 25, job: develope
Name: shyam, dtype: object

In [62]:
for i, col in df.items():
    print(i, col)
    break

age name
shyam    25.0
ram      25.0
ravi     45.0
raj       NaN
john     25.0
Name: age, dtype: float64

In [63]:
df.age > 50

name
shyam    False
ram      False
ravi     False
raj      False
john     False
Name: age, dtype: bool

In [65]:
df[df.age > 30]

       age job           summary
name
ravi  45.0  HR  Age: 45, job: HR

In [67]:
df[(df.age > 25) & (df.job.notna())]

       age job           summary
name
ravi  45.0  HR  Age: 45, job: HR

In [68]:
df[df.job.notna()]

        age        job                  summary
name
shyam  25.0   develope   Age: 25, job: develope
ram    25.0  developer  Age: 25, job: developer
ravi   45.0         HR         Age: 45, job: HR
raj     NaN   designer   Age: 32, job: designer
john   25.0     drawer     Age: 25, job: drawer

In [69]:
# reverse of above case
df[~df.job.notna()]

Empty DataFrame
Columns: [age, job, summary]
Index: []

In [76]:
df = df.reset_index()

In [78]:
df[df.name.str.endswith('i')]

   name   age job           summary
2  ravi  45.0  HR  Age: 45, job: HR

In [81]:
df.age = df.age.fillna(30)

In [82]:
import datetime as dt
# its won't work if 'age' in 'nan' so fill that nan value
df['birthday'] = df['age'].apply(lambda x : dt.datetime.now() - dt.timedelta(days=365*x))

In [83]:
df

    name   age        job                  summary                   birthday
0  shyam  25.0   develope   Age: 25, job: develope 2000-04-13 13:07:56.858664
1    ram  25.0  developer  Age: 25, job: developer 2000-04-13 13:07:56.858664
2   ravi  45.0         HR         Age: 45, job: HR 1980-04-18 13:07:56.858664
3    raj  30.0   designer   Age: 32, job: designer 1995-04-15 13:07:56.858664
4   john  25.0     drawer     Age: 25, job: drawer 2000-04-13 13:07:56.858664

In [85]:
df[df.birthday.dt.year > 1990]

    name   age        job                  summary                   birthday
0  shyam  25.0   develope   Age: 25, job: develope 2000-04-13 13:07:56.858664
1    ram  25.0  developer  Age: 25, job: developer 2000-04-13 13:07:56.858664
3    raj  30.0   designer   Age: 32, job: designer 1995-04-15 13:07:56.858664
4   john  25.0     drawer     Age: 25, job: drawer 2000-04-13 13:07:56.858664

In [86]:
ages = [30, 45]
df[df.age.isin(ages)]

   name   age       job                 summary                   birthday
2  ravi  45.0        HR        Age: 45, job: HR 1980-04-18 13:07:56.858664
3   raj  30.0  designer  Age: 32, job: designer 1995-04-15 13:07:56.858664

In [87]:
# this query is very fast compare to other commands
df.query('age>26')

   name   age       job                 summary                   birthday
2  ravi  45.0        HR        Age: 45, job: HR 1980-04-18 13:07:56.858664
3   raj  30.0  designer  Age: 32, job: designer 1995-04-15 13:07:56.858664

In [88]:
df

    name   age        job                  summary                   birthday
0  shyam  25.0   develope   Age: 25, job: develope 2000-04-13 13:07:56.858664
1    ram  25.0  developer  Age: 25, job: developer 2000-04-13 13:07:56.858664
2   ravi  45.0         HR         Age: 45, job: HR 1980-04-18 13:07:56.858664
3    raj  30.0   designer   Age: 32, job: designer 1995-04-15 13:07:56.858664
4   john  25.0     drawer     Age: 25, job: drawer 2000-04-13 13:07:56.858664

In [89]:
# Grouping

In [90]:
df.groupby('job')

In [91]:
df.groupby('job').agg({
    'age': 'mean'
})

            age
job
HR         45.0
designer   30.0
develope   25.0
developer  25.0
drawer     25.0

In [92]:
df

    name   age        job                  summary                   birthday
0  shyam  25.0   develope   Age: 25, job: develope 2000-04-13 13:07:56.858664
1    ram  25.0  developer  Age: 25, job: developer 2000-04-13 13:07:56.858664
2   ravi  45.0         HR         Age: 45, job: HR 1980-04-18 13:07:56.858664
3    raj  30.0   designer   Age: 32, job: designer 1995-04-15 13:07:56.858664
4   john  25.0     drawer     Age: 25, job: drawer 2000-04-13 13:07:56.858664

In [93]:
# adding other row
df.loc[4] = ['jane',55,'designer',None,None]

In [94]:
df

    name   age        job                  summary                   birthday
0  shyam  25.0   develope   Age: 25, job: develope 2000-04-13 13:07:56.858664
1    ram  25.0  developer  Age: 25, job: developer 2000-04-13 13:07:56.858664
2   ravi  45.0         HR         Age: 45, job: HR 1980-04-18 13:07:56.858664
3    raj  30.0   designer   Age: 32, job: designer 1995-04-15 13:07:56.858664
4   jane  55.0   designer                     None                        NaT

In [95]:
df.groupby('job').agg({
    'age': 'mean'
})

            age
job
HR         45.0
designer   42.5
develope   25.0
developer  25.0

In [96]:
df.groupby('job').agg({
    'age': ['mean','sum','max','min']
})

            age
           mean   sum   max   min
job
HR         45.0  45.0  45.0  45.0
designer   42.5  85.0  55.0  30.0
develope   25.0  25.0  25.0  25.0
developer  25.0  25.0  25.0  25.0

In [97]:
df

    name   age        job                  summary                   birthday
0  shyam  25.0   develope   Age: 25, job: develope 2000-04-13 13:07:56.858664
1    ram  25.0  developer  Age: 25, job: developer 2000-04-13 13:07:56.858664
2   ravi  45.0         HR         Age: 45, job: HR 1980-04-18 13:07:56.858664
3    raj  30.0   designer   Age: 32, job: designer 1995-04-15 13:07:56.858664
4   jane  55.0   designer                     None                        NaT

In [100]:
df.sort_values("age",ascending=False)

    name   age        job                  summary                   birthday
4   jane  55.0   designer                     None                        NaT
2   ravi  45.0         HR         Age: 45, job: HR 1980-04-18 13:07:56.858664
3    raj  30.0   designer   Age: 32, job: designer 1995-04-15 13:07:56.858664
0  shyam  25.0   develope   Age: 25, job: develope 2000-04-13 13:07:56.858664
1    ram  25.0  developer  Age: 25, job: developer 2000-04-13 13:07:56.858664

In [101]:
# Merging Concatinating, Joining

In [102]:
df1 = pd.DataFrame({
    'Item':['A','B','C'],
    'Price':[10,20,30]
})

df2 = pd.DataFrame({
    'Item':['D','E','F'],
    'Price':[40,50,60]
})

In [115]:
df1,df2

(  Item  Price
 0    A     10
 1    B     20
 2    C     30,
   Item  Price
 0    D     40
 1    E     50
 2    F     60)

In [111]:
# stack rows
pd.concat([df1,df2]).reset_index().drop('index',axis=1)

  Item  Price
0    A     10
1    B     20
2    C     30
3    D     40
4    E     50
5    F     60

In [112]:
df3 = pd.DataFrame({
    'Item':['A','B','C'],
    'Price':[10,20,30]
})

df4 = pd.DataFrame({
    'Country':['X','Y','Z'],
    'Availbale':[True,True,False]
})

In [114]:
pd.concat([df3,df4],axis=1)

  Item  Price Country  Availbale
0    A     10       X       True
1    B     20       Y       True
2    C     30       Z      False

In [116]:
df5 = pd.DataFrame({
    'Item':['B','C','D'],
    'Country':['X','Y','Z']
})

In [119]:
df5

  Item Country
0    B       X
1    C       Y
2    D       Z

In [118]:
df1

  Item  Price
0    A     10
1    B     20
2    C     30

In [120]:
# i wanna join df1 and df5
# here it merge only common values
pd.merge(df1,df5)

  Item  Price Country
0    B     20       X
1    C     30       Y

In [124]:
# it will give all other values also
# if you don't provide how='outer' by default it takes 'inner'
# if we use 'left' it will keep all left table and 'right' for right table. 
pd.merge(df1,df5,how='outer')

  Item  Price Country
0    A   10.0     NaN
1    B   20.0       X
2    C   30.0       Y
3    D    NaN       Z

In [125]:
# you can also specify what column going to merge like 'item'
pd.merge(df1,df5, on='Item', how='outer')

  Item  Price Country
0    A   10.0     NaN
1    B   20.0       X
2    C   30.0       Y
3    D    NaN       Z

In [129]:
df6 = pd.DataFrame({
    'Price': [10, 20, 30]
}, index=['A', 'B', 'C'])

df7 = pd.DataFrame({
    'Country': ['X', 'Y', 'Z']
}, index=['B', 'C', 'D'])

In [130]:
# it will join based on index we can also use df6.join(df7,how='outer')
df6.join(df7)

   Price Country
A     10     NaN
B     20       X
C     30       Y